from dataclasses import dataclass


@dataclass
class lexicon:
    start: str = '''Приветствую! Я простой бот для игры в крестики и нолики!

Нажми кнопку "Начать", чтобы перейти к выбору режима игры.

Или, если ты хочешь узнать правила игры, то нажми кнопку "Правила"'''

    rules: str = '''Один из игроков играет «крестиками», второй — «ноликами».
    
Игроки по очереди ставят на свободные клетки поля 3х3 знаки (один всегда крестики, другой всегда нолики).

 Первый игрок, который выстроит в ряд 3 свои фигуры по вертикали, горизонтали или диагонали, выигрывает.
 
 Первый ход делает игрок, ставящий крестики.'''
    mode: str = '''Выберите режим игры:
"Компьютер" - проявите свои навыки против компьютера! Сумеете ли вы одержать верх над бездушной и бесстрастной машиной?

"Против другого игрока" - сразитесь с другим игроком. Испытайте свою удачу и мастерство, проявите всю свою хитрость и расчётливость - одержите победу над другим игроком или падите ниц жертвою беспощадной судьбы!

"На двоих" - сыграйте вместе с другим человеком на одном компьютере!'''
    game_process = lambda sign, next_sign: f'{sign} сделал свой ход! Теперь ходит {next_sign}!'
    cancel = '''Игра была отменена! Жаль!..'''
    game_start = lambda sign: f'Игра началась! Вы - {sign}! Ходит Крестик!'
